##  Connecting via Python
We'll be using a pandas connector alongside SQLAlchemy to connect to this database

SQLAlchemy: generates SQL statements

psycopg2: sends SQL statements to the database ( SQLAlchemy uses psycogp2 to communicate 
with our database)

In [15]:
from sqlalchemy import create_engine
import pandas as pd
cnx = create_engine('postgresql://kaitlinpuryear@54.196.215.198:5432/kaitlinpuryear')
#port ~ 5432

In [16]:
pd.read_sql_query('''SELECT * FROM allstarfull LIMIT 5''',cnx)

    playerid  yearid gamenum        gameid teamid lgid gp startingpos
0  gomezle01    1933       0  ALS193307060    NYA   AL  1           1
1  ferreri01    1933       0  ALS193307060    BOS   AL  1           2
2  gehrilo01    1933       0  ALS193307060    NYA   AL  1           3
3  gehrich01    1933       0  ALS193307060    DET   AL  1           4
4  dykesji01    1933       0  ALS193307060    CHA   AL  1           5

create_engine : establishes how we are communicate with the database.
    and defines where the db is.

In [17]:
pd.read_sql_query('''SELECT * FROM schools LIMIT 5''',cnx)

,schoolid,schoolname,schoolcity,schoolstate,schoolnick
0,abilchrist,Abilene Christian University,Abilene,TX,Wildcats
1,adelphi,Adelphi University,Garden City,NY,Panthers
2,adrianmi,Adrian College,Adrian,MI,Bulldogs
3,airforce,United States Air Force Academy,Colorado Springs,CO,Falcons
4,akron,University of Akron,Akron,OH,Zips

###   How many schools are there in each state?

In [18]:
pd.read_sql_query('''SELECT schoolstate,Count(schoolid) as ct FROM schools Group By schoolstate ORDER BY ct DESC LIMIT 5''',cnx)

  schoolstate  ct
0          PA  57
1          CA  48
2          NY  45
3          TX  41
4          OH  33

### Show all playerids and salaries with a salary in the year 1985 above 500k.

In [19]:
pd.read_sql_query('''SELECT playerid,salary 
                     FROM Salaries 
                     WHERE yearid = '1985' and salary > '500000' LIMIT 5;''',cnx)

    playerid    salary
0  barkele01  870000.0
1  bedrost01  550000.0
2  benedbr01  545000.0
3   campri01  633333.0
4  ceronri01  625000.0